Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/dma2d_struct.h
/*
 * SPDX-FileCopyrightText: 2017-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_DMA2D_STRUCT_H_
#define _SOC_DMA2D_STRUCT_H_


#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct {
    struct {
        union {
            struct {
                uint32_t out_auto_wrback               :    1;  /*Set this bit to enable automatic outlink-writeback when all the data pointed by outlink descriptor has been received.*/
                uint32_t out_eof_mode                  :    1;  /*EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is generated when data need to read has been popped from FIFO in DMA*/
                uint32_t outdscr_burst_en              :    1;  /*Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link descriptor when accessing internal SRAM. */
                uint32_t out_ecc_aes_en                :    1;  /*When access address space is ecc/aes area, this bit should be set to 1. In this case, the start address of square should be 16-bit aligned. The width of square multiply byte number of one pixel should be 16-bit aligned. */
                uint32_t out_check_owner               :    1;  /*Set this bit to enable checking the owner attribute of the link descriptor.*/
                uint32_t out_loop_test                 :    1;  /*reserved*/
                uint32_t out_mem_burst_length          :    3;  /*Block size of Tx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64 bytes    4: 128 bytes*/
                uint32_t out_macro_block_size          :    2;  /*Sel TX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2: 16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link descriptor*/
                uint32_t out_dscr_port_en              :    1;  /*Set this bit to 1 to obtain descriptor from IP port*/
                uint32_t out_page_bound_en             :    1;  /*Set this bit to 1 to make sure AXI read data don't cross the address boundary which define by mem_burst_length*/
                uint32_t reserved13                    :    3;  /*reserved*/
                uint32_t out_reorder_en                :    1;  /*Enable TX channel 0 macro block reorder when set to 1, only channel0 have this selection*/
                uint32_t reserved17                    :    7;  /*reserved*/
                uint32_t out_rst                       :    1;  /*Write 1 then write 0 to this bit to reset TX channel*/
                uint32_t out_cmd_disable               :    1;  /*Write 1 before reset and write 0 after reset*/
                uint32_t out_arb_weight_opt_dis        :    1;  /*Set this bit to 1 to disable arbiter optimum weight function.*/
                uint32_t reserved27                    :    5;  /*reserved*/
            };
            uint32_t val;
        } conf0;
        union {
            struct {
                uint32_t out_done                      :    1;  /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 0.*/
                uint32_t out_eof                       :    1;  /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 0. */
                uint32_t out_dscr_err                  :    1;  /*The raw interrupt bit turns to high level when detecting outlink descriptor error, including owner error, the second and third word error of outlink descriptor for Tx channel 0.*/
                uint32_t out_total_eof                 :    1;  /*The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 0.*/
                uint32_t outfifo_ovf_l1                :    1;  /*The raw interrupt bit turns to high level when fifo is overflow. */
                uint32_t outfifo_udf_l1                :    1;  /*The raw interrupt bit turns to high level when fifo is underflow. */
                uint32_t outfifo_ovf_l2                :    1;  /*The raw interrupt bit turns to high level when fifo is overflow. */
                uint32_t outfifo_udf_l2                :    1;  /*The raw interrupt bit turns to high level when fifo is underflow. */
                uint32_t outfifo_ovf_l3                :    1;  /*The raw interrupt bit turns to high level when fifo is overflow. */
                uint32_t outfifo_udf_l3                :    1;  /*The raw interrupt bit turns to high level when fifo is underflow. */
                uint32_t outfifo_ro_ovf                :    1;  /*The raw interrupt bit turns to high level when reorder fifo is overflow. */
                uint32_t outfifo_ro_udf                :    1;  /*The raw interrupt bit turns to high level when reorder fifo is underflow. */
                uint32_t out_dscr_task_ovf             :    1;  /*The raw interrupt bit turns to high level when dscr ready task fifo is overflow. */
                uint32_t reserved13                    :    19;  /*reserved*/
            };
            uint32_t val;
        } int_raw;
        union {
            struct {
                uint32_t out_done                      :    1;  /*The interrupt enable bit for the OUT_DONE_CH_INT interrupt.*/
                uint32_t out_eof                       :    1;  /*The interrupt enable bit for the OUT_EOF_CH_INT interrupt.*/
                uint32_t out_dscr_err                  :    1;  /*The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
                uint32_t out_total_eof                 :    1;  /*The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l1                :    1;  /*The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
                uint32_t outfifo_udf_l1                :    1;  /*The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l2                :    1;  /*The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.*/
                uint32_t outfifo_udf_l2                :    1;  /*The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l3                :    1;  /*The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
                uint32_t outfifo_udf_l3                :    1;  /*The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
                uint32_t outfifo_ro_ovf                :    1;  /*The interrupt enable bit for the OUTFIFO_RO_OVF_CH_INT interrupt.*/
                uint32_t outfifo_ro_udf                :    1;  /*The interrupt enable bit for the OUTFIFO_RO_UDF_CH_INT interrupt.*/
                uint32_t out_dscr_task_ovf             :    1;  /*The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.*/
                uint32_t reserved13                    :    19;  /*reserved*/
            };
            uint32_t val;
        } int_ena;
        union {
            struct {
                uint32_t out_done                      :    1;  /*The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
                uint32_t out_eof                       :    1;  /*The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
                uint32_t out_dscr_err                  :    1;  /*The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
                uint32_t out_total_eof                 :    1;  /*The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l1                :    1;  /*The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
                uint32_t outfifo_udf_l1                :    1;  /*The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l2                :    1;  /*The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.*/
                uint32_t outfifo_udf_l2                :    1;  /*The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l3                :    1;  /*The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
                uint32_t outfifo_udf_l3                :    1;  /*The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
                uint32_t outfifo_ro_ovf                :    1;  /*The raw interrupt status bit for the OUTFIFO_RO_OVF_CH_INT interrupt.*/
                uint32_t outfifo_ro_udf                :    1;  /*The raw interrupt status bit for the OUTFIFO_RO_UDF_CH_INT interrupt.*/
                uint32_t out_dscr_task_ovf             :    1;  /*The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.*/
                uint32_t reserved13                    :    19;  /*reserved*/
            };
            uint32_t val;
        } int_st;
        union {
            struct {
                uint32_t out_done                      :    1;  /*Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
                uint32_t out_eof                       :    1;  /*Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
                uint32_t out_dscr_err                  :    1;  /*Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
                uint32_t out_total_eof                 :    1;  /*Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l1                :    1;  /*Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
                uint32_t outfifo_udf_l1                :    1;  /*Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l2                :    1;  /*Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.*/
                uint32_t outfifo_udf_l2                :    1;  /*Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.*/
                uint32_t outfifo_ovf_l3                :    1;  /*Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
                uint32_t outfifo_udf_l3                :    1;  /*Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
                uint32_t outfifo_ro_ovf                :    1;  /*Set this bit to clear the OUTFIFO_RO_OVF_CH_INT interrupt.*/
                uint32_t outfifo_ro_udf                :    1;  /*Set this bit to clear the OUTFIFO_RO_UDF_CH_INT interrupt.*/
                uint32_t out_dscr_task_ovf             :    1;  /*Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.*/
                uint32_t reserved13                    :    19;  /*reserved*/
            };
            uint32_t val;
        } int_clr;
        union {
            struct {
                uint32_t outfifo_full_l2               :    1;  /*Tx FIFO full signal for Tx channel 0.*/
                uint32_t outfifo_empty_l2              :    1;  /*Tx FIFO empty signal for Tx channel 0.*/
                uint32_t outfifo_cnt_l2                :    4;  /*The register stores the byte number of the data in Tx FIFO for Tx channel 0.*/
                uint32_t reserved6                     :    1;  /*reserved*/
                uint32_t out_remain_under_1b           :    1;  /*reserved*/
                uint32_t out_remain_under_2b           :    1;  /*reserved*/
                uint32_t out_remain_under_3b           :    1;  /*reserved*/
                uint32_t out_remain_under_4b           :    1;  /*reserved*/
                uint32_t out_remain_under_5b           :    1;  /*reserved*/
                uint32_t out_remain_under_6b           :    1;  /*reserved*/
                uint32_t out_remain_under_7b           :    1;  /*reserved*/
                uint32_t out_remain_under_8b           :    1;  /*reserved*/
                uint32_t outfifo_full_l1               :    1;  /*Tx FIFO full signal for Tx channel 0.*/
                uint32_t outfifo_empty_l1              :    1;  /*Tx FIFO empty signal for Tx channel 0.*/
                uint32_t outfifo_cnt_l1                :    5;  /*The register stores the byte number of the data in Tx FIFO for Tx channel 0.*/
                uint32_t outfifo_full_l3               :    1;  /*Tx FIFO full signal for Tx channel 0.*/
                uint32_t outfifo_empty_l3              :    1;  /*Tx FIFO empty signal for Tx channel 0.*/
                uint32_t outfifo_cnt_l3                :    5;  /*The register stores the byte number of the data in Tx FIFO for Tx channel 0.*/
                uint32_t reserved29                    :    3;  /*reserved*/
            };
            uint32_t val;
        } outfifo_status;
        union {
            struct {
                uint32_t outfifo_wdata                 :    10;  /*This register stores the data that need to be pushed into DMA Tx FIFO.*/
                uint32_t outfifo_push                  :    1;  /*Set this bit to push data into DMA Tx FIFO.*/
                uint32_t reserved11                    :    21;  /*reserved*/
            };
            uint32_t val;
        } push;
        union {
            struct {
                uint32_t reserved0                     :    20;  /*reserved*/
                uint32_t outlink_stop                  :    1;  /*Set this bit to stop dealing with the outlink descriptors.*/
                uint32_t outlink_start                 :    1;  /*Set this bit to start dealing with the outlink descriptors.*/
                uint32_t outlink_restart               :    1;  /*Set this bit to restart a new outlink from the last address. */
                uint32_t outlink_park                  :    1;  /*1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.*/
                uint32_t reserved24                    :    8;  /*reserved*/
            };
            uint32_t val;
        } link_conf;
        uint32_t link_addr;
        union {
            struct {
                uint32_t outlink_dscr_addr             :    18;  /*This register stores the current outlink descriptor's address.*/
                uint32_t out_dscr_state                :    2;  /*This register stores the current descriptor state machine state.*/
                uint32_t out_state                     :    4;  /*This register stores the current control module state machine state.*/
                uint32_t out_reset_avail               :    1;  /*This register indicate that if the channel reset is safety.*/
                uint32_t reserved25                    :    7;  /*reserved*/
            };
            uint32_t val;
        } state;
        uint32_t eof_des_addr;
        uint32_t dscr;
        uint32_t dscr_bf0;
        uint32_t dscr_bf1;
        union {
            struct {
                uint32_t out_peri_sel                  :    3;  /*This register is used to select peripheral for Tx channel   0:  jpeg     1: display-1     2: display-2     3: display-3      7: no choose*/
                uint32_t reserved3                     :    29;  /*reserved*/
            };
            uint32_t val;
        } peri_sel;
        union {
            struct {
                uint32_t out_arb_token_num             :    4;  /*Set the max number of token count of arbiter*/
                uint32_t out_arb_priority              :    2;  /*Set the priority of channel*/
                uint32_t reserved6                     :    26;  /*reserved*/
            };
            uint32_t val;
        } arb;
        union {
            struct {
                uint32_t outfifo_ro_cnt                :    6;  /*The register stores the byte number of the data in color convert Tx FIFO for channel 0.*/
                uint32_t out_ro_wr_state               :    2;  /*The register stores the state of read ram of reorder*/
                uint32_t out_ro_rd_state               :    2;  /*The register stores the state of write ram of reorder*/
                uint32_t out_pixel_byte                :    4;  /*the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes     2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes*/
                uint32_t out_burst_block_num           :    4;  /*the number of macro blocks contained in a burst of data at TX channel*/
                uint32_t reserved18                    :    14;  /*reserved*/
            };
            uint32_t val;
        } ro_status;
        union {
            struct {
                uint32_t reserved0                     :    4;  /*reserved*/
                uint32_t out_ro_ram_force_pd           :    1;  /*dma reorder ram power down*/
                uint32_t out_ro_ram_force_pu           :    1;  /*dma reorder ram power up*/
                uint32_t out_ro_ram_clk_fo             :    1;  /*1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA. 0: A gate-clock will be used when accessing the RAM in DMA.*/
                uint32_t reserved7                     :    25;  /*reserved*/
            };
            uint32_t val;
        } ro_pd_conf;
        union {
            struct {
                uint32_t out_color_output_sel          :    2;  /*Set final color convert process and output type    0: RGB888 to RGB565     1: YUV444 to YUV422     2: output directly*/
                uint32_t out_color_3b_proc_en          :    1;  /*Enable generic color convert modlue between color input & color output, need to configure parameter.*/
                uint32_t out_color_input_sel           :    3;  /*Set first color convert process and input color type    0: RGB565 to RGB888     1: YUV422 to YUV444      2: Other 2byte/pixel type    3: Other 3byte/pixel type    7: disable color space convert*/
                uint32_t reserved6                     :    26;  /*reserved*/
            };
            uint32_t val;
        } color_convert;
        union {
            struct {
                uint32_t out_scramble_sel_pre          :    3;  /*Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2*/
                uint32_t reserved3                     :    29;  /*reserved*/
            };
            uint32_t val;
        } scramble;
        union {
            struct {
                uint32_t out_color_param_h0            :    21;  /*Set first 2 parameter of most significant byte of pending 3 bytes*/
                uint32_t reserved21                    :    11;  /*reserved*/
            };
            uint32_t val;
        } color_param0;
        union {
            struct {
                uint32_t out_color_param_h1            :    28;  /*Set last 2 parameter of most significant byte of pending 3 bytes*/
                uint32_t reserved28                    :    4;  /*reserved*/
            };
            uint32_t val;
        } color_param1;
        union {
            struct {
                uint32_t out_color_param_m0            :    21;  /*Set first 2 parameter of midium significant byte of pending 3 bytes*/
                uint32_t reserved21                    :    11;  /*reserved*/
            };
            uint32_t val;
        } color_param2;
        union {
            struct {
                uint32_t out_color_param_m1            :    28;  /*Set last 2 parameter of midium significant byte of pending 3 bytes*/
                uint32_t reserved28                    :    4;  /*reserved*/
            };
            uint32_t val;
        } color_param3;
        union {
            struct {
                uint32_t out_color_param_l0            :    21;  /*Set first 2 parameter of least significant byte of pending 3 bytes*/
                uint32_t reserved21                    :    11;  /*reserved*/
            };
            uint32_t val;
        } color_param4;
        union {
            struct {
                uint32_t out_color_param_l1            :    28;  /*Set last 2 parameter of least significant byte of pending 3 bytes*/
                uint32_t reserved28                    :    4;  /*reserved*/
            };
            uint32_t val;
        } color_param5;
        union {
            struct {
                uint32_t out_etm_en                    :    1;  /*Configures the enable of the etm function, 1 is enable.*/
                uint32_t out_etm_loop_en               :    1;  /*Configures the enable of the descriptors loop etm function, 1 is enable.*/
                uint32_t out_dscr_task_max             :    2;  /*Configures the maximum number of cacheable descriptors.*/
                uint32_t reserved4                     :    28;  /*reserved*/
            };
            uint32_t val;
        } etm_conf;
        union {
            struct {
                uint32_t out_dscr_port_blk_h           :    14;  /*Set the vertical height of tx block size in dscr port mode*/
                uint32_t out_dscr_port_blk_v           :    14;  /*Set the horizontal width of tx block size in dscr port mode*/
                uint32_t reserved28                    :    4;  /*reserved*/
            };
            uint32_t val;
        } dscr_port_blk;
        uint32_t reserved_70;
        uint32_t reserved_74;
        uint32_t reserved_78;
        uint32_t reserved_7c;
        uint32_t reserved_80;
        uint32_t reserved_84;
        uint32_t reserved_88;
        uint32_t reserved_8c;
        uint32_t reserved_90;
        uint32_t reserved_94;
        uint32_t reserved_98;
        uint32_t reserved_9c;
        uint32_t reserved_a0;
        uint32_t reserved_a4;
        uint32_t reserved_a8;
        uint32_t reserved_ac;
        uint32_t reserved_b0;
        uint32_t reserved_b4;
        uint32_t reserved_b8;
        uint32_t reserved_bc;
        uint32_t reserved_c0;
        uint32_t reserved_c4;
        uint32_t reserved_c8;
        uint32_t reserved_cc;
        uint32_t reserved_d0;
        uint32_t reserved_d4;
        uint32_t reserved_d8;
        uint32_t reserved_dc;
        uint32_t reserved_e0;
        uint32_t reserved_e4;
        uint32_t reserved_e8;
        uint32_t reserved_ec;
        uint32_t reserved_f0;
        uint32_t reserved_f4;
        uint32_t reserved_f8;
        uint32_t reserved_fc;
    } out_ch[3];
    uint32_t reserved_300;
    uint32_t reserved_304;
    uint32_t reserved_308;
    uint32_t reserved_30c;
    uint32_t reserved_310;
    uint32_t reserved_314;
    uint32_t reserved_318;
    uint32_t reserved_31c;
    uint32_t reserved_320;
    uint32_t reserved_324;
    uint32_t reserved_328;
    uint32_t reserved_32c;
    uint32_t reserved_330;
    uint32_t reserved_334;
    uint32_t reserved_338;
    uint32_t reserved_33c;
    uint32_t reserved_340;
    uint32_t reserved_344;
    uint32_t reserved_348;
    uint32_t reserved_34c;
    uint32_t reserved_350;
    uint32_t reserved_354;
    uint32_t reserved_358;
    uint32_t reserved_35c;
    uint32_t reserved_360;
    uint32_t reserved_364;
    uint32_t reserved_368;
    uint32_t reserved_36c;
    uint32_t reserved_370;
    uint32_t reserved_374;
    uint32_t reserved_378;
    uint32_t reserved_37c;
    uint32_t reserved_380;
    uint32_t reserved_384;
    uint32_t reserved_388;
    uint32_t reserved_38c;
    uint32_t reserved_390;
    uint32_t reserved_394;
    uint32_t reserved_398;
    uint32_t reserved_39c;
    uint32_t reserved_3a0;
    uint32_t reserved_3a4;
    uint32_t reserved_3a8;
    uint32_t reserved_3ac;
    uint32_t reserved_3b0;
    uint32_t reserved_3b4;
    uint32_t reserved_3b8;
    uint32_t reserved_3bc;
    uint32_t reserved_3c0;
    uint32_t reserved_3c4;
    uint32_t reserved_3c8;
    uint32_t reserved_3cc;
    uint32_t reserved_3d0;
    uint32_t reserved_3d4;
    uint32_t reserved_3d8;
    uint32_t reserved_3dc;
    uint32_t reserved_3e0;
    uint32_t reserved_3e4;
