Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/dma2d_struct.h
        uint32_t reserved_5e4;
        uint32_t reserved_5e8;
        uint32_t reserved_5ec;
        uint32_t reserved_5f0;
        uint32_t reserved_5f4;
        uint32_t reserved_5f8;
        uint32_t reserved_5fc;
    } in_ch0;
    struct {
        union {
            struct {
                uint32_t in_mem_trans_en               :    1;  /*enable memory trans of the same channel*/
                uint32_t reserved1                     :    1;  /*reserved*/
                uint32_t indscr_burst_en               :    1;  /*Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor when accessing SRAM. */
                uint32_t in_ecc_aes_en                 :    1;  /*When access address space is ecc/aes area, this bit should be set to 1. In this case, the start address of square should be 16-bit aligned. The width of square multiply byte number of one pixel should be 16-bit aligned. */
                uint32_t in_check_owner                :    1;  /*Set this bit to enable checking the owner attribute of the link descriptor.*/
                uint32_t in_loop_test                  :    1;  /*reserved*/
                uint32_t in_mem_burst_length           :    3;  /*Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64 bytes    4: 128 bytes*/
                uint32_t in_macro_block_size           :    2;  /*Sel RX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2: 16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link descriptor*/
                uint32_t in_dscr_port_en               :    1;  /*Set this bit to 1 to obtain descriptor from IP port*/
                uint32_t in_page_bound_en              :    1;  /*Set this bit to 1 to make sure AXI write data don't cross the address boundary which define by mem_burst_length*/
                uint32_t reserved13                    :    3;  /*reserved*/
                uint32_t in_reorder_en                 :    1;  /*Enable RX channel 0 macro block reorder when set to 1, only channel0 have this selection*/
                uint32_t reserved17                    :    7;  /*reserved*/
                uint32_t in_rst                        :    1;  /*Write 1 then write 0 to this bit to reset Rx channel*/
                uint32_t in_cmd_disable                :    1;  /*Write 1 before reset and write 0 after reset*/
                uint32_t in_arb_weight_opt_dis         :    1;  /*Set this bit to 1 to disable arbiter optimum weight function.*/
                uint32_t reserved27                    :    5;  /*reserved*/
            };
            uint32_t val;
        } conf0;
        union {
            struct {
                uint32_t in_done                       :    1;  /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been transmitted to peripherals for Rx channel 0.*/
                uint32_t in_suc_eof                    :    1;  /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 0.*/
                uint32_t in_err_eof                    :    1;  /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and data error is detected */
                uint32_t in_dscr_err                   :    1;  /*The raw interrupt bit turns to high level when detecting inlink descriptor error, including owner error, the second and third word error of inlink descriptor for Rx channel 0.*/
                uint32_t infifo_ovf_l1                 :    1;  /*The raw interrupt bit turns to high level when fifo of Rx channel is overflow. */
                uint32_t infifo_udf_l1                 :    1;  /*The raw interrupt bit turns to high level when fifo of Rx channel is underflow. */
                uint32_t infifo_ovf_l2                 :    1;  /*The raw interrupt bit turns to high level when fifo of Rx channel is overflow. */
                uint32_t infifo_udf_l2                 :    1;  /*The raw interrupt bit turns to high level when fifo of Rx channel is underflow. */
                uint32_t infifo_ovf_l3                 :    1;  /*The raw interrupt bit turns to high level when fifo of Rx channel is overflow. */
                uint32_t infifo_udf_l3                 :    1;  /*The raw interrupt bit turns to high level when fifo of Rx channel is underflow. */
                uint32_t in_dscr_empty                 :    1;  /*The raw interrupt bit turns to high level when the last descriptor is done but fifo also remain data.*/
                uint32_t infifo_ro_ovf                 :    1;  /*The raw interrupt bit turns to high level when reorder fifo is overflow. */
                uint32_t infifo_ro_udf                 :    1;  /*The raw interrupt bit turns to high level when reorder fifo is underflow. */
                uint32_t in_dscr_task_ovf              :    1;  /*The raw interrupt bit turns to high level when dscr ready task fifo is overflow. */
                uint32_t reserved14                    :    18;  /*reserved*/
            };
            uint32_t val;
        } int_raw;
        union {
            struct {
                uint32_t in_done                       :    1;  /*The interrupt enable bit for the IN_DONE_CH_INT interrupt.*/
                uint32_t in_suc_eof                    :    1;  /*The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.*/
                uint32_t in_err_eof                    :    1;  /*The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.*/
                uint32_t in_dscr_err                   :    1;  /*The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.*/
                uint32_t infifo_ovf_l1                 :    1;  /*The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
                uint32_t infifo_udf_l1                 :    1;  /*The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
                uint32_t infifo_ovf_l2                 :    1;  /*The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.*/
                uint32_t infifo_udf_l2                 :    1;  /*The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.*/
                uint32_t infifo_ovf_l3                 :    1;  /*The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
                uint32_t infifo_udf_l3                 :    1;  /*The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
                uint32_t in_dscr_empty                 :    1;  /*The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
                uint32_t infifo_ro_ovf                 :    1;  /*The interrupt enable bit for the INFIFO_RO_OVF_CH_INT interrupt.*/
                uint32_t infifo_ro_udf                 :    1;  /*The interrupt enable bit for the INFIFO_RO_UDF_CH_INT interrupt.*/
                uint32_t in_dscr_task_ovf              :    1;  /*The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.*/
                uint32_t reserved14                    :    18;  /*reserved*/
            };
            uint32_t val;
        } int_ena;
        union {
            struct {
                uint32_t in_done                       :    1;  /*The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
                uint32_t in_suc_eof                    :    1;  /*The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
                uint32_t in_err_eof                    :    1;  /*The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
                uint32_t in_dscr_err                   :    1;  /*The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
                uint32_t infifo_ovf_l1                 :    1;  /*The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
                uint32_t infifo_udf_l1                 :    1;  /*The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
                uint32_t infifo_ovf_l2                 :    1;  /*The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.*/
                uint32_t infifo_udf_l2                 :    1;  /*The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.*/
                uint32_t infifo_ovf_l3                 :    1;  /*The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
                uint32_t infifo_udf_l3                 :    1;  /*The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
                uint32_t in_dscr_empty                 :    1;  /*The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
                uint32_t infifo_ro_ovf                 :    1;  /*The raw interrupt status bit for the INFIFO_RO_OVF_CH_INT interrupt.*/
                uint32_t infifo_ro_udf                 :    1;  /*The raw interrupt status bit for the INFIFO_RO_UDF_CH_INT interrupt.*/
                uint32_t in_dscr_task_ovf              :    1;  /*The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.*/
                uint32_t reserved14                    :    18;  /*reserved*/
            };
            uint32_t val;
        } int_st;
        union {
            struct {
                uint32_t in_done                       :    1;  /*Set this bit to clear the IN_DONE_CH_INT interrupt.*/
                uint32_t in_suc_eof                    :    1;  /*Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
                uint32_t in_err_eof                    :    1;  /*Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
                uint32_t in_dscr_err                   :    1;  /*Set this bit to clear the INDSCR_ERR_CH_INT interrupt.*/
                uint32_t infifo_ovf_l1                 :    1;  /*Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
                uint32_t infifo_udf_l1                 :    1;  /*Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
                uint32_t infifo_ovf_l2                 :    1;  /*Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.*/
                uint32_t infifo_udf_l2                 :    1;  /*Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.*/
                uint32_t infifo_ovf_l3                 :    1;  /*Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
                uint32_t infifo_udf_l3                 :    1;  /*Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
                uint32_t in_dscr_empty                 :    1;  /*Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
                uint32_t infifo_ro_ovf                 :    1;  /*Set this bit to clear the INFIFO_RO_OVF_CH_INT interrupt.*/
                uint32_t infifo_ro_udf                 :    1;  /*Set this bit to clear the INFIFO_RO_UDF_CH_INT interrupt.*/
                uint32_t in_dscr_task_ovf              :    1;  /*Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.*/
                uint32_t reserved14                    :    18;  /*reserved*/
            };
            uint32_t val;
        } int_clr;
        union {
            struct {
                uint32_t infifo_full_l2                :    1;  /*Rx FIFO full signal for Rx channel.*/
                uint32_t infifo_empty_l2               :    1;  /*Rx FIFO empty signal for Rx channel.*/
                uint32_t infifo_cnt_l2                 :    4;  /*The register stores the byte number of the data in Rx FIFO for Rx channel.*/
                uint32_t reserved6                     :    1;  /*reserved*/
                uint32_t in_remain_under_1b            :    1;  /*reserved*/
                uint32_t in_remain_under_2b            :    1;  /*reserved*/
                uint32_t in_remain_under_3b            :    1;  /*reserved*/
                uint32_t in_remain_under_4b            :    1;  /*reserved*/
                uint32_t in_remain_under_5b            :    1;  /*reserved*/
                uint32_t in_remain_under_6b            :    1;  /*reserved*/
                uint32_t in_remain_under_7b            :    1;  /*reserved*/
                uint32_t in_remain_under_8b            :    1;  /*reserved*/
                uint32_t infifo_full_l1                :    1;  /*Tx FIFO full signal for Tx channel 0.*/
                uint32_t infifo_empty_l1               :    1;  /*Tx FIFO empty signal for Tx channel 0.*/
                uint32_t infifo_cnt_l1                 :    5;  /*The register stores the byte number of the data in Tx FIFO for Tx channel 0.*/
                uint32_t infifo_full_l3                :    1;  /*Tx FIFO full signal for Tx channel 0.*/
                uint32_t infifo_empty_l3               :    1;  /*Tx FIFO empty signal for Tx channel 0.*/
                uint32_t infifo_cnt_l3                 :    5;  /*The register stores the byte number of the data in Tx FIFO for Tx channel 0.*/
                uint32_t reserved29                    :    3;  /*reserved*/
            };
            uint32_t val;
        } infifo_status;
        union {
            struct {
                uint32_t infifo_rdata                  :    11;  /*This register stores the data popping from DMA Rx FIFO.*/
                uint32_t infifo_pop                    :    1;  /*Set this bit to pop data from DMA Rx FIFO.*/
                uint32_t reserved12                    :    20;  /*reserved*/
            };
            uint32_t val;
        } pop;
        union {
            struct {
                uint32_t reserved0                     :    20;  /*reserved*/
                uint32_t inlink_auto_ret               :    1;  /*Set this bit to return to current inlink descriptor's address, when there are some errors in current receiving data.*/
                uint32_t inlink_stop                   :    1;  /*Set this bit to stop dealing with the inlink descriptors.*/
                uint32_t inlink_start                  :    1;  /*Set this bit to start dealing with the inlink descriptors.*/
                uint32_t inlink_restart                :    1;  /*Set this bit to mount a new inlink descriptor.*/
                uint32_t inlink_park                   :    1;  /*1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.*/
                uint32_t reserved25                    :    7;  /*reserved*/
            };
            uint32_t val;
        } link_conf;
        uint32_t link_addr;
        union {
            struct {
                uint32_t inlink_dscr_addr              :    18;  /*This register stores the current inlink descriptor's address.*/
                uint32_t in_dscr_state                 :    2;  /*reserved*/
                uint32_t in_state                      :    3;  /*reserved*/
                uint32_t in_reset_avail                :    1;  /*This register indicate that if the channel reset is safety.*/
                uint32_t reserved24                    :    8;  /*reserved*/
            };
            uint32_t val;
        } state;
        uint32_t suc_eof_des_addr;
        uint32_t err_eof_des_addr;
        uint32_t dscr;
        uint32_t dscr_bf0;
        uint32_t dscr_bf1;
        union {
            struct {
                uint32_t in_peri_sel                   :    3;  /*This register is used to select peripheral for Rx channel   0:  jpeg     1: display-1     2: display-2        7: no choose*/
                uint32_t reserved3                     :    29;  /*reserved*/
            };
            uint32_t val;
        } peri_sel;
        union {
            struct {
                uint32_t in_arb_token_num              :    4;  /*Set the max number of token count of arbiter*/
                uint32_t in_arb_priority               :    1;  /*Set the priority of channel*/
                uint32_t reserved5                     :    27;  /*reserved*/
            };
            uint32_t val;
        } arb;
        union {
            struct {
                uint32_t infifo_ro_cnt                 :    5;  /*The register stores the byte number of the data in color convert Rx FIFO for channel 0.*/
                uint32_t in_ro_wr_state                :    2;  /*The register stores the state of read ram of reorder*/
                uint32_t in_ro_rd_state                :    2;  /*The register stores the state of write ram of reorder*/
                uint32_t in_pixel_byte                 :    4;  /*the number of bytes contained in a pixel at RX channel     0: 1byte     1: 1.5bytes     2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes*/
                uint32_t in_burst_block_num            :    4;  /*the number of macro blocks contained in a burst of data at RX channel*/
                uint32_t reserved17                    :    15;  /*reserved*/
            };
            uint32_t val;
        } ro_status;
        union {
            struct {
                uint32_t in_etm_en                     :    1;  /*Configures the enable of the etm function, 1 is enable.*/
                uint32_t in_etm_loop_en                :    1;  /*Configures the enable of the descriptors loop etm function, 1 is enable.*/
                uint32_t in_dscr_task_max              :    2;  /*Configures the maximum number of cacheable descriptors.*/
                uint32_t reserved4                     :    28;  /*reserved*/
            };
            uint32_t val;
        } etm_conf;
        uint32_t reserved_570;
        uint32_t reserved_574;
        uint32_t reserved_578;
        uint32_t reserved_57c;
        uint32_t reserved_580;
        uint32_t reserved_584;
        uint32_t reserved_588;
        uint32_t reserved_58c;
        uint32_t reserved_590;
        uint32_t reserved_594;
        uint32_t reserved_598;
        uint32_t reserved_59c;
        uint32_t reserved_5a0;
        uint32_t reserved_5a4;
        uint32_t reserved_5a8;
        uint32_t reserved_5ac;
        uint32_t reserved_5b0;
        uint32_t reserved_5b4;
        uint32_t reserved_5b8;
        uint32_t reserved_5bc;
        uint32_t reserved_5c0;
        uint32_t reserved_5c4;
        uint32_t reserved_5c8;
        uint32_t reserved_5cc;
        uint32_t reserved_5d0;
        uint32_t reserved_5d4;
        uint32_t reserved_5d8;
        uint32_t reserved_5dc;
        uint32_t reserved_5e0;
        uint32_t reserved_5e4;
        uint32_t reserved_5e8;
        uint32_t reserved_5ec;
        uint32_t reserved_5f0;
        uint32_t reserved_5f4;
        uint32_t reserved_5f8;
        uint32_t reserved_5fc;
    } in_ch1;
    uint32_t reserved_6dc;
    uint32_t reserved_6e0;
    uint32_t reserved_6e4;
    uint32_t reserved_6e8;
    uint32_t reserved_6ec;
    uint32_t reserved_6f0;
    uint32_t reserved_6f4;
    uint32_t reserved_6f8;
    uint32_t reserved_6fc;
    uint32_t reserved_700;
    uint32_t reserved_704;
    uint32_t reserved_708;
    uint32_t reserved_70c;
    uint32_t reserved_710;
    uint32_t reserved_714;
    uint32_t reserved_718;
    uint32_t reserved_71c;
    uint32_t reserved_720;
    uint32_t reserved_724;
    uint32_t reserved_728;
    uint32_t reserved_72c;
    uint32_t reserved_730;
    uint32_t reserved_734;
    uint32_t reserved_738;
    uint32_t reserved_73c;
    uint32_t reserved_740;
    uint32_t reserved_744;
    uint32_t reserved_748;
    uint32_t reserved_74c;
    uint32_t reserved_750;
    uint32_t reserved_754;
    uint32_t reserved_758;
    uint32_t reserved_75c;
    uint32_t reserved_760;
    uint32_t reserved_764;
    uint32_t reserved_768;
    uint32_t reserved_76c;
    uint32_t reserved_770;
    uint32_t reserved_774;
    uint32_t reserved_778;
    uint32_t reserved_77c;
    uint32_t reserved_780;
    uint32_t reserved_784;
    uint32_t reserved_788;
    uint32_t reserved_78c;
    uint32_t reserved_790;
    uint32_t reserved_794;
    uint32_t reserved_798;
    uint32_t reserved_79c;
    uint32_t reserved_7a0;
    uint32_t reserved_7a4;
    uint32_t reserved_7a8;
    uint32_t reserved_7ac;
    uint32_t reserved_7b0;
    uint32_t reserved_7b4;
    uint32_t reserved_7b8;
    uint32_t reserved_7bc;
    uint32_t reserved_7c0;
    uint32_t reserved_7c4;
    uint32_t reserved_7c8;
    uint32_t reserved_7cc;
    uint32_t reserved_7d0;
    uint32_t reserved_7d4;
    uint32_t reserved_7d8;
    uint32_t reserved_7dc;
    uint32_t reserved_7e0;
    uint32_t reserved_7e4;
    uint32_t reserved_7e8;
    uint32_t reserved_7ec;
    uint32_t reserved_7f0;
    uint32_t reserved_7f4;
    uint32_t reserved_7f8;
    uint32_t reserved_7fc;
    uint32_t reserved_800;
    uint32_t reserved_804;
    uint32_t reserved_808;
    uint32_t reserved_80c;
    uint32_t reserved_810;
    uint32_t reserved_814;
    uint32_t reserved_818;
    uint32_t reserved_81c;
    uint32_t reserved_820;
    uint32_t reserved_824;
    uint32_t reserved_828;
    uint32_t reserved_82c;
    uint32_t reserved_830;
    uint32_t reserved_834;
    uint32_t reserved_838;
    uint32_t reserved_83c;
    uint32_t reserved_840;
    uint32_t reserved_844;
    uint32_t reserved_848;
    uint32_t reserved_84c;
    uint32_t reserved_850;
    uint32_t reserved_854;
    uint32_t reserved_858;
    uint32_t reserved_85c;
    uint32_t reserved_860;
    uint32_t reserved_864;
    uint32_t reserved_868;
    uint32_t reserved_86c;
    uint32_t reserved_870;
    uint32_t reserved_874;
    uint32_t reserved_878;
    uint32_t reserved_87c;
    uint32_t reserved_880;
    uint32_t reserved_884;
    uint32_t reserved_888;
    uint32_t reserved_88c;
    uint32_t reserved_890;
    uint32_t reserved_894;
    uint32_t reserved_898;
    uint32_t reserved_89c;
    uint32_t reserved_8a0;
    uint32_t reserved_8a4;
    uint32_t reserved_8a8;
    uint32_t reserved_8ac;
    uint32_t reserved_8b0;
    uint32_t reserved_8b4;
    uint32_t reserved_8b8;
    uint32_t reserved_8bc;
    uint32_t reserved_8c0;
    uint32_t reserved_8c4;
    uint32_t reserved_8c8;
    uint32_t reserved_8cc;
    uint32_t reserved_8d0;
    uint32_t reserved_8d4;
    uint32_t reserved_8d8;
    uint32_t reserved_8dc;
    uint32_t reserved_8e0;
    uint32_t reserved_8e4;
    uint32_t reserved_8e8;
    uint32_t reserved_8ec;
    uint32_t reserved_8f0;
    uint32_t reserved_8f4;
    uint32_t reserved_8f8;
    uint32_t reserved_8fc;
    uint32_t reserved_900;
    uint32_t reserved_904;
    uint32_t reserved_908;
    uint32_t reserved_90c;
    uint32_t reserved_910;
    uint32_t reserved_914;
    uint32_t reserved_918;
    uint32_t reserved_91c;
    uint32_t reserved_920;
    uint32_t reserved_924;
    uint32_t reserved_928;
    uint32_t reserved_92c;
    uint32_t reserved_930;
    uint32_t reserved_934;
    uint32_t reserved_938;
    uint32_t reserved_93c;
    uint32_t reserved_940;
    uint32_t reserved_944;
    uint32_t reserved_948;
    uint32_t reserved_94c;
    uint32_t reserved_950;
    uint32_t reserved_954;
    uint32_t reserved_958;
    uint32_t reserved_95c;
    uint32_t reserved_960;
    uint32_t reserved_964;
    uint32_t reserved_968;
    uint32_t reserved_96c;
    uint32_t reserved_970;
    uint32_t reserved_974;
    uint32_t reserved_978;
    uint32_t reserved_97c;
    uint32_t reserved_980;
    uint32_t reserved_984;
    uint32_t reserved_988;
    uint32_t reserved_98c;
    uint32_t reserved_990;
    uint32_t reserved_994;
    uint32_t reserved_998;
    uint32_t reserved_99c;
    uint32_t reserved_9a0;
    uint32_t reserved_9a4;
    uint32_t reserved_9a8;
    uint32_t reserved_9ac;
    uint32_t reserved_9b0;
    uint32_t reserved_9b4;
    uint32_t reserved_9b8;
    uint32_t reserved_9bc;
    uint32_t reserved_9c0;
    uint32_t reserved_9c4;
    uint32_t reserved_9c8;
    uint32_t reserved_9cc;
    uint32_t reserved_9d0;
    uint32_t reserved_9d4;
    uint32_t reserved_9d8;
    uint32_t reserved_9dc;
    uint32_t reserved_9e0;
    uint32_t reserved_9e4;
    uint32_t reserved_9e8;
