Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/dma2d_struct.h
    uint32_t reserved_9ec;
    uint32_t reserved_9f0;
    uint32_t reserved_9f4;
    uint32_t reserved_9f8;
    uint32_t reserved_9fc;
    union {
        struct {
            uint32_t rid_err_cnt                   :    4;  /*AXI read id err cnt*/
            uint32_t rresp_err_cnt                 :    4;  /*AXI read resp err cnt*/
            uint32_t wresp_err_cnt                 :    4;  /*AXI write resp err cnt*/
            uint32_t rd_fifo_cnt                   :    3;  /*AXI read cmd fifo remain cmd count*/
            uint32_t rd_bak_fifo_cnt               :    4;  /*AXI read backup cmd fifo remain cmd count*/
            uint32_t wr_fifo_cnt                   :    3;  /*AXI write cmd fifo remain cmd count*/
            uint32_t wr_bak_fifo_cnt               :    4;  /*AXI write backup cmd fifo remain cmd count*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } axi_err;
    union {
        struct {
            uint32_t axim_rd_rst                   :    1;  /*Write 1 then write 0  to this bit to reset axi master read data FIFO.*/
            uint32_t axim_wr_rst                   :    1;  /*Write 1 then write 0  to this bit to reset axi master write data FIFO.*/
            uint32_t clk_en                        :    1;  /*1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } rst_conf;
    uint32_t intr_mem_start_addr;
    uint32_t intr_mem_end_addr;
    uint32_t extr_mem_start_addr;
    uint32_t extr_mem_end_addr;
    union {
        struct {
            uint32_t out_arb_timeout_num           :    16;  /*Set the max number of timeout count of arbiter*/
            uint32_t out_weight_en                 :    1;  /*reserved*/
            uint32_t reserved17                    :    15;  /*reserved*/
        };
        uint32_t val;
    } out_arb_config;
    union {
        struct {
            uint32_t in_arb_timeout_num            :    16;  /*Set the max number of timeout count of arbiter*/
            uint32_t in_weight_en                  :    1;  /*reserved*/
            uint32_t reserved17                    :    15;  /*reserved*/
        };
        uint32_t val;
    } in_arb_config;
    union {
        struct {
            uint32_t rdn_ena                       :    1;  /*reserved*/
            uint32_t rdn_result                    :    1;  /*reserved*/
            uint32_t reserved2                     :    30;  /*reserved*/
        };
        uint32_t val;
    } rdn_result;
    uint32_t rdn_eco_high;
    uint32_t rdn_eco_low;
    uint32_t date;
} dma2d_dev_t;
extern dma2d_dev_t DMA2D;
#ifdef __cplusplus
}
#endif



#endif /*_SOC_DMA2D_STRUCT_H_ */
